MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S3A8/mcu.h
/*******************  Bit definition for EXTI_EMR2 register  ******************/
#define EXTI_EMR2_EM32_Pos           (0U)
#define EXTI_EMR2_EM32_Msk           (0x1UL << EXTI_EMR2_EM32_Pos)             /*!< 0x00000001 */
#define EXTI_EMR2_EM32               EXTI_EMR2_EM32_Msk                        /*!< Event Mask on line 32 */
#define EXTI_EMR2_EM33_Pos           (1U)
#define EXTI_EMR2_EM33_Msk           (0x1UL << EXTI_EMR2_EM33_Pos)             /*!< 0x00000002 */
#define EXTI_EMR2_EM33               EXTI_EMR2_EM33_Msk                        /*!< Event Mask on line 33 */
#define EXTI_EMR2_EM34_Pos           (2U)
#define EXTI_EMR2_EM34_Msk           (0x1UL << EXTI_EMR2_EM34_Pos)             /*!< 0x00000004 */
#define EXTI_EMR2_EM34               EXTI_EMR2_EM34_Msk                        /*!< Event Mask on line 34 */
#define EXTI_EMR2_EM35_Pos           (3U)
#define EXTI_EMR2_EM35_Msk           (0x1UL << EXTI_EMR2_EM35_Pos)             /*!< 0x00000008 */
#define EXTI_EMR2_EM35               EXTI_EMR2_EM35_Msk                        /*!< Event Mask on line 35 */
#define EXTI_EMR2_EM36_Pos           (4U)
#define EXTI_EMR2_EM36_Msk           (0x1UL << EXTI_EMR2_EM36_Pos)             /*!< 0x00000010 */
#define EXTI_EMR2_EM36               EXTI_EMR2_EM36_Msk                        /*!< Event Mask on line 36 */
#define EXTI_EMR2_EM37_Pos           (5U)
#define EXTI_EMR2_EM37_Msk           (0x1UL << EXTI_EMR2_EM37_Pos)             /*!< 0x00000020 */
#define EXTI_EMR2_EM37               EXTI_EMR2_EM37_Msk                        /*!< Event Mask on line 37 */
#define EXTI_EMR2_EM38_Pos           (6U)
#define EXTI_EMR2_EM38_Msk           (0x1UL << EXTI_EMR2_EM38_Pos)             /*!< 0x00000040 */
#define EXTI_EMR2_EM38               EXTI_EMR2_EM38_Msk                        /*!< Event Mask on line 38 */
#define EXTI_EMR2_EM39_Pos           (7U)
#define EXTI_EMR2_EM39_Msk           (0x1UL << EXTI_EMR2_EM39_Pos)             /*!< 0x00000080 */
#define EXTI_EMR2_EM39               EXTI_EMR2_EM39_Msk                        /*!< Event Mask on line 39 */
#define EXTI_EMR2_EM40_Pos           (8U)
#define EXTI_EMR2_EM40_Msk           (0x1UL << EXTI_EMR2_EM40_Pos)             /*!< 0x00000100 */
#define EXTI_EMR2_EM40               EXTI_EMR2_EM40_Msk                        /*!< Event Mask on line 40 */
#define EXTI_EMR2_EM41_Pos           (9U)
#define EXTI_EMR2_EM41_Msk           (0x1UL << EXTI_EMR2_EM41_Pos)             /*!< 0x00000200 */
#define EXTI_EMR2_EM41               EXTI_EMR2_EM41_Msk                        /*!< Event Mask on line 41 */
#define EXTI_EMR2_EM42_Pos           (10U)
#define EXTI_EMR2_EM42_Msk           (0x1UL << EXTI_EMR2_EM42_Pos)             /*!< 0x00000400 */
#define EXTI_EMR2_EM42               EXTI_EMR2_EM42_Msk                        /*!< Event Mask on line 42 */
#define EXTI_EMR2_EM43_Pos           (11U)
#define EXTI_EMR2_EM43_Msk           (0x1UL << EXTI_EMR2_EM43_Pos)             /*!< 0x00000800 */
#define EXTI_EMR2_EM43               EXTI_EMR2_EM43_Msk                        /*!< Event Mask on line 43 */
#define EXTI_EMR2_EM44_Pos           (12U)
#define EXTI_EMR2_EM44_Msk           (0x1UL << EXTI_EMR2_EM44_Pos)             /*!< 0x00001000 */
#define EXTI_EMR2_EM44               EXTI_EMR2_EM44_Msk                        /*!< Event Mask on line 44 */
#define EXTI_EMR2_EM45_Pos           (13U)
#define EXTI_EMR2_EM45_Msk           (0x1UL << EXTI_EMR2_EM45_Pos)             /*!< 0x00002000 */
#define EXTI_EMR2_EM45               EXTI_EMR2_EM45_Msk                        /*!< Event Mask on line 45 */
#define EXTI_EMR2_EM46_Pos           (14U)
#define EXTI_EMR2_EM46_Msk           (0x1UL << EXTI_EMR2_EM46_Pos)             /*!< 0x00004000 */
#define EXTI_EMR2_EM46               EXTI_EMR2_EM46_Msk                        /*!< Event Mask on line 46 */
#define EXTI_EMR2_EM47_Pos           (15U)
#define EXTI_EMR2_EM47_Msk           (0x1UL << EXTI_EMR2_EM47_Pos)             /*!< 0x00008000 */
#define EXTI_EMR2_EM47               EXTI_EMR2_EM47_Msk                        /*!< Event Mask on line 47 */
#define EXTI_EMR2_EM48_Pos           (16U)
#define EXTI_EMR2_EM48_Msk           (0x1UL << EXTI_EMR2_EM48_Pos)             /*!< 0x00010000 */
#define EXTI_EMR2_EM48               EXTI_EMR2_EM48_Msk                        /*!< Event Mask on line 48 */
#define EXTI_EMR2_EM49_Pos           (17U)
#define EXTI_EMR2_EM49_Msk           (0x1UL << EXTI_EMR2_EM49_Pos)             /*!< 0x00020000 */
#define EXTI_EMR2_EM49               EXTI_EMR2_EM49_Msk                        /*!< Event Mask on line 49 */
#define EXTI_EMR2_EM50_Pos           (18U)
#define EXTI_EMR2_EM50_Msk           (0x1UL << EXTI_EMR2_EM50_Pos)             /*!< 0x00040000 */
#define EXTI_EMR2_EM50               EXTI_EMR2_EM50_Msk                        /*!< Event Mask on line 50 */
#define EXTI_EMR2_EM51_Pos           (19U)
#define EXTI_EMR2_EM51_Msk           (0x1UL << EXTI_EMR2_EM51_Pos)             /*!< 0x00080000 */
#define EXTI_EMR2_EM51               EXTI_EMR2_EM51_Msk                        /*!< Event Mask on line 51 */
#define EXTI_EMR2_EM52_Pos           (20U)
#define EXTI_EMR2_EM52_Msk           (0x1UL << EXTI_EMR2_EM52_Pos)             /*!< 0x00100000 */
#define EXTI_EMR2_EM52               EXTI_EMR2_EM52_Msk                        /*!< Event Mask on line 52 */
#define EXTI_EMR2_EM53_Pos           (21U)
#define EXTI_EMR2_EM53_Msk           (0x1UL << EXTI_EMR2_EM53_Pos)             /*!< 0x00200000 */
#define EXTI_EMR2_EM53               EXTI_EMR2_EM53_Msk                        /*!< Event Mask on line 53 */
#define EXTI_EMR2_EM54_Pos           (22U)
#define EXTI_EMR2_EM54_Msk           (0x1UL << EXTI_EMR2_EM54_Pos)             /*!< 0x00400000 */
#define EXTI_EMR2_EM54               EXTI_EMR2_EM54_Msk                        /*!< Event Mask on line 54 */
#define EXTI_EMR2_EM55_Pos           (23U)
#define EXTI_EMR2_EM55_Msk           (0x1UL << EXTI_EMR2_EM55_Pos)             /*!< 0x00800000 */
#define EXTI_EMR2_EM55               EXTI_EMR2_EM55_Msk                        /*!< Event Mask on line 55 */
#define EXTI_EMR2_EM56_Pos           (24U)
#define EXTI_EMR2_EM56_Msk           (0x1UL << EXTI_EMR2_EM56_Pos)             /*!< 0x01000000 */
#define EXTI_EMR2_EM56               EXTI_EMR2_EM56_Msk                        /*!< Event Mask on line 56 */
#define EXTI_EMR2_EM57_Pos           (25U)
#define EXTI_EMR2_EM57_Msk           (0x1UL << EXTI_EMR2_EM57_Pos)             /*!< 0x02000000 */
#define EXTI_EMR2_EM57               EXTI_EMR2_EM57_Msk                        /*!< Event Mask on line 57 */
#define EXTI_EMR2_EM58_Pos           (26U)
#define EXTI_EMR2_EM58_Msk           (0x1UL << EXTI_EMR2_EM58_Pos)             /*!< 0x04000000 */
#define EXTI_EMR2_EM58               EXTI_EMR2_EM58_Msk                        /*!< Event Mask on line 58 */
#define EXTI_EMR2_EM59_Pos           (27U)
#define EXTI_EMR2_EM59_Msk           (0x1UL << EXTI_EMR2_EM59_Pos)             /*!< 0x08000000 */
#define EXTI_EMR2_EM59               EXTI_EMR2_EM59_Msk                        /*!< Event Mask on line 59 */

/*******************  Bit definition for EXTI_EMR3 register  ******************/
#define EXTI_EMR3_EM77_Pos           (13U)
#define EXTI_EMR3_EM77_Msk           (0x1UL << EXTI_EMR3_EM77_Pos)             /*!< 0x00002000 */
#define EXTI_EMR3_EM77               EXTI_EMR3_EM77_Msk                        /*!< Event Mask on line 77 */

/*******************  Bit definition for EXTI_PR1 register  *******************/
#define EXTI_PR1_PR0_Pos             (0U)
#define EXTI_PR1_PR0_Msk             (0x1UL << EXTI_PR1_PR0_Pos)               /*!< 0x00000001 */
#define EXTI_PR1_PR0                 EXTI_PR1_PR0_Msk                          /*!< Pending bit for line 0 */
#define EXTI_PR1_PR1_Pos             (1U)
#define EXTI_PR1_PR1_Msk             (0x1UL << EXTI_PR1_PR1_Pos)               /*!< 0x00000002 */
#define EXTI_PR1_PR1                 EXTI_PR1_PR1_Msk                          /*!< Pending bit for line 1 */
#define EXTI_PR1_PR2_Pos             (2U)
#define EXTI_PR1_PR2_Msk             (0x1UL << EXTI_PR1_PR2_Pos)               /*!< 0x00000004 */
#define EXTI_PR1_PR2                 EXTI_PR1_PR2_Msk                          /*!< Pending bit for line 2 */
#define EXTI_PR1_PR3_Pos             (3U)
#define EXTI_PR1_PR3_Msk             (0x1UL << EXTI_PR1_PR3_Pos)               /*!< 0x00000008 */
#define EXTI_PR1_PR3                 EXTI_PR1_PR3_Msk                          /*!< Pending bit for line 3 */
#define EXTI_PR1_PR4_Pos             (4U)
#define EXTI_PR1_PR4_Msk             (0x1UL << EXTI_PR1_PR4_Pos)               /*!< 0x00000010 */
#define EXTI_PR1_PR4                 EXTI_PR1_PR4_Msk                          /*!< Pending bit for line 4 */
#define EXTI_PR1_PR5_Pos             (5U)
#define EXTI_PR1_PR5_Msk             (0x1UL << EXTI_PR1_PR5_Pos)               /*!< 0x00000020 */
#define EXTI_PR1_PR5                 EXTI_PR1_PR5_Msk                          /*!< Pending bit for line 5 */
#define EXTI_PR1_PR6_Pos             (6U)
#define EXTI_PR1_PR6_Msk             (0x1UL << EXTI_PR1_PR6_Pos)               /*!< 0x00000040 */
#define EXTI_PR1_PR6                 EXTI_PR1_PR6_Msk                          /*!< Pending bit for line 6 */
#define EXTI_PR1_PR7_Pos             (7U)
#define EXTI_PR1_PR7_Msk             (0x1UL << EXTI_PR1_PR7_Pos)               /*!< 0x00000080 */
#define EXTI_PR1_PR7                 EXTI_PR1_PR7_Msk                          /*!< Pending bit for line 7 */
#define EXTI_PR1_PR8_Pos             (8U)
#define EXTI_PR1_PR8_Msk             (0x1UL << EXTI_PR1_PR8_Pos)               /*!< 0x00000100 */
#define EXTI_PR1_PR8                 EXTI_PR1_PR8_Msk                          /*!< Pending bit for line 8 */
#define EXTI_PR1_PR9_Pos             (9U)
#define EXTI_PR1_PR9_Msk             (0x1UL << EXTI_PR1_PR9_Pos)               /*!< 0x00000200 */
#define EXTI_PR1_PR9                 EXTI_PR1_PR9_Msk                          /*!< Pending bit for line 9 */
#define EXTI_PR1_PR10_Pos            (10U)
#define EXTI_PR1_PR10_Msk            (0x1UL << EXTI_PR1_PR10_Pos)              /*!< 0x00000400 */
#define EXTI_PR1_PR10                EXTI_PR1_PR10_Msk                         /*!< Pending bit for line 10 */
#define EXTI_PR1_PR11_Pos            (11U)
#define EXTI_PR1_PR11_Msk            (0x1UL << EXTI_PR1_PR11_Pos)              /*!< 0x00000800 */
#define EXTI_PR1_PR11                EXTI_PR1_PR11_Msk                         /*!< Pending bit for line 11 */
#define EXTI_PR1_PR12_Pos            (12U)
#define EXTI_PR1_PR12_Msk            (0x1UL << EXTI_PR1_PR12_Pos)              /*!< 0x00001000 */
#define EXTI_PR1_PR12                EXTI_PR1_PR12_Msk                         /*!< Pending bit for line 12 */
#define EXTI_PR1_PR13_Pos            (13U)
#define EXTI_PR1_PR13_Msk            (0x1UL << EXTI_PR1_PR13_Pos)              /*!< 0x00002000 */
#define EXTI_PR1_PR13                EXTI_PR1_PR13_Msk                         /*!< Pending bit for line 13 */
#define EXTI_PR1_PR14_Pos            (14U)
#define EXTI_PR1_PR14_Msk            (0x1UL << EXTI_PR1_PR14_Pos)              /*!< 0x00004000 */
#define EXTI_PR1_PR14                EXTI_PR1_PR14_Msk                         /*!< Pending bit for line 14 */
#define EXTI_PR1_PR15_Pos            (15U)
#define EXTI_PR1_PR15_Msk            (0x1UL << EXTI_PR1_PR15_Pos)              /*!< 0x00008000 */
#define EXTI_PR1_PR15                EXTI_PR1_PR15_Msk                         /*!< Pending bit for line 15 */
#define EXTI_PR1_PR16_Pos            (16U)
#define EXTI_PR1_PR16_Msk            (0x1UL << EXTI_PR1_PR16_Pos)              /*!< 0x00010000 */
#define EXTI_PR1_PR16                EXTI_PR1_PR16_Msk                         /*!< Pending bit for line 16 */
#define EXTI_PR1_PR17_Pos            (17U)
#define EXTI_PR1_PR17_Msk            (0x1UL << EXTI_PR1_PR17_Pos)              /*!< 0x00020000 */
#define EXTI_PR1_PR17                EXTI_PR1_PR17_Msk                         /*!< Pending bit for line 17 */
#define EXTI_PR1_PR18_Pos            (18U)
#define EXTI_PR1_PR18_Msk            (0x1UL << EXTI_PR1_PR18_Pos)              /*!< 0x00040000 */
#define EXTI_PR1_PR18                EXTI_PR1_PR18_Msk                         /*!< Pending bit for line 18 */
#define EXTI_PR1_PR19_Pos            (19U)
#define EXTI_PR1_PR19_Msk            (0x1UL << EXTI_PR1_PR19_Pos)              /*!< 0x00080000 */
#define EXTI_PR1_PR19                EXTI_PR1_PR19_Msk                         /*!< Pending bit for line 19 */
#define EXTI_PR1_PR20_Pos            (20U)
#define EXTI_PR1_PR20_Msk            (0x1UL << EXTI_PR1_PR20_Pos)              /*!< 0x00100000 */
#define EXTI_PR1_PR20                EXTI_PR1_PR20_Msk                         /*!< Pending bit for line 20 */
#define EXTI_PR1_PR21_Pos            (21U)
#define EXTI_PR1_PR21_Msk            (0x1UL << EXTI_PR1_PR21_Pos)              /*!< 0x00200000 */
#define EXTI_PR1_PR21                EXTI_PR1_PR21_Msk                         /*!< Pending bit for line 21 */

