MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S3A8/mcu.h
/******************  Bits definition for FLASH_ISR register  ******************/
#define FLASH_ISR_EOPF_Pos                   (16U)
#define FLASH_ISR_EOPF_Msk                   (0x1UL << FLASH_ISR_EOPF_Pos)                       /*!< 0x00010000 */
#define FLASH_ISR_EOPF                       FLASH_ISR_EOPF_Msk                                  /*!< End of program flag */
#define FLASH_ISR_WRPERRF_Pos                (17U)
#define FLASH_ISR_WRPERRF_Msk                (0x1UL << FLASH_ISR_WRPERRF_Pos)                    /*!< 0x00020000 */
#define FLASH_ISR_WRPERRF                    FLASH_ISR_WRPERRF_Msk                               /*!< Write protection error flag */
#define FLASH_ISR_PGSERRF_Pos                (18U)
#define FLASH_ISR_PGSERRF_Msk                (0x1UL << FLASH_ISR_PGSERRF_Pos)                    /*!< 0x00040000 */
#define FLASH_ISR_PGSERRF                    FLASH_ISR_PGSERRF_Msk                               /*!< Programming sequence error flag */
#define FLASH_ISR_STRBERRF_Pos               (19U)
#define FLASH_ISR_STRBERRF_Msk               (0x1UL << FLASH_ISR_STRBERRF_Pos)                   /*!< 0x00080000 */
#define FLASH_ISR_STRBERRF                   FLASH_ISR_STRBERRF_Msk                              /*!< Strobe error flag */
#define FLASH_ISR_OBLERRF_Pos                (20U)
#define FLASH_ISR_OBLERRF_Msk                (0x1UL << FLASH_ISR_OBLERRF_Pos)                    /*!< 0x00100000 */
#define FLASH_ISR_OBLERRF                    FLASH_ISR_OBLERRF_Msk                               /*!< Option byte loading error flag */
#define FLASH_ISR_INCERRF_Pos                (21U)
#define FLASH_ISR_INCERRF_Msk                (0x1UL << FLASH_ISR_INCERRF_Pos)                    /*!< 0x00200000 */
#define FLASH_ISR_INCERRF                    FLASH_ISR_INCERRF_Msk                               /*!< Inconsistency error flag */
#define FLASH_ISR_RDSERRF_Pos                (24U)
#define FLASH_ISR_RDSERRF_Msk                (0x1UL << FLASH_ISR_RDSERRF_Pos)                    /*!< 0x01000000 */
#define FLASH_ISR_RDSERRF                    FLASH_ISR_RDSERRF_Msk                               /*!< Read security error flag */
#define FLASH_ISR_SNECCERRF_Pos              (25U)
#define FLASH_ISR_SNECCERRF_Msk              (0x1UL << FLASH_ISR_SNECCERRF_Pos)                  /*!< 0x02000000 */
#define FLASH_ISR_SNECCERRF                  FLASH_ISR_SNECCERRF_Msk                             /*!< ECC single error flag */
#define FLASH_ISR_DBECCERRF_Pos              (26U)
#define FLASH_ISR_DBECCERRF_Msk              (0x1UL << FLASH_ISR_DBECCERRF_Pos)                  /*!< 0x04000000 */
#define FLASH_ISR_DBECCERRF                  FLASH_ISR_DBECCERRF_Msk                             /*!< ECC double error flag */
#define FLASH_ISR_CRCENDF_Pos                (27U)
#define FLASH_ISR_CRCENDF_Msk                (0x1UL << FLASH_ISR_CRCENDF_Pos)                    /*!< 0x08000000 */
#define FLASH_ISR_CRCENDF                    FLASH_ISR_CRCENDF_Msk                               /*!< CRC end of calculation flag */
#define FLASH_ISR_CRCRDERRF_Pos              (28U)
#define FLASH_ISR_CRCRDERRF_Msk              (0x1UL << FLASH_ISR_CRCRDERRF_Pos)                  /*!< 0x10000000 */
#define FLASH_ISR_CRCRDERRF                  FLASH_ISR_CRCRDERRF_Msk                             /*!< CRC read error flag */

/******************  Bits definition for FLASH_ICR register  ******************/
#define FLASH_ICR_EOPF_Pos                   (16U)
#define FLASH_ICR_EOPF_Msk                   (0x1UL << FLASH_ICR_EOPF_Pos)                       /*!< 0x00010000 */
#define FLASH_ICR_EOPF                       FLASH_ICR_EOPF_Msk                                  /*!< End of program flag clear */
#define FLASH_ICR_WRPERRF_Pos                (17U)
#define FLASH_ICR_WRPERRF_Msk                (0x1UL << FLASH_ICR_WRPERRF_Pos)                    /*!< 0x00020000 */
#define FLASH_ICR_WRPERRF                    FLASH_ICR_WRPERRF_Msk                               /*!< Write protection error flag clear */
#define FLASH_ICR_PGSERRF_Pos                (18U)
#define FLASH_ICR_PGSERRF_Msk                (0x1UL << FLASH_ICR_PGSERRF_Pos)                    /*!< 0x00040000 */
#define FLASH_ICR_PGSERRF                    FLASH_ICR_PGSERRF_Msk                               /*!< Programming sequence error flag clear */
#define FLASH_ICR_STRBERRF_Pos               (19U)
#define FLASH_ICR_STRBERRF_Msk               (0x1UL << FLASH_ICR_STRBERRF_Pos)                   /*!< 0x00080000 */
#define FLASH_ICR_STRBERRF                   FLASH_ICR_STRBERRF_Msk                              /*!< Strobe error flag clear */
#define FLASH_ICR_OBLERRF_Pos                (20U)
#define FLASH_ICR_OBLERRF_Msk                (0x1UL << FLASH_ICR_OBLERRF_Pos)                    /*!< 0x00100000 */
#define FLASH_ICR_OBLERRF                    FLASH_ICR_OBLERRF_Msk                               /*!< Option byte loading error flag clear */
#define FLASH_ICR_INCERRF_Pos                (21U)
#define FLASH_ICR_INCERRF_Msk                (0x1UL << FLASH_ICR_INCERRF_Pos)                    /*!< 0x00200000 */
#define FLASH_ICR_INCERRF                    FLASH_ICR_INCERRF_Msk                               /*!< Inconsistency error flag clear */
#define FLASH_ICR_RDSERRF_Pos                (24U)
#define FLASH_ICR_RDSERRF_Msk                (0x1UL << FLASH_ICR_RDSERRF_Pos)                    /*!< 0x01000000 */
#define FLASH_ICR_RDSERRF                    FLASH_ICR_RDSERRF_Msk                               /*!< Read security error flag clear */
#define FLASH_ICR_SNECCERRF_Pos              (25U)
#define FLASH_ICR_SNECCERRF_Msk              (0x1UL << FLASH_ICR_SNECCERRF_Pos)                  /*!< 0x02000000 */
#define FLASH_ICR_SNECCERRF                  FLASH_ICR_SNECCERRF_Msk                             /*!< ECC single error flag clear */
#define FLASH_ICR_DBECCERRF_Pos              (26U)
#define FLASH_ICR_DBECCERRF_Msk              (0x1UL << FLASH_ICR_DBECCERRF_Pos)                  /*!< 0x04000000 */
#define FLASH_ICR_DBECCERRF                  FLASH_ICR_DBECCERRF_Msk                             /*!< ECC double error flag clear */
#define FLASH_ICR_CRCENDF_Pos                (27U)
#define FLASH_ICR_CRCENDF_Msk                (0x1UL << FLASH_ICR_CRCENDF_Pos)                    /*!< 0x08000000 */
#define FLASH_ICR_CRCENDF                    FLASH_ICR_CRCENDF_Msk                               /*!< CRC end flag clear */
#define FLASH_ICR_CRCRDERRF_Pos              (28U)
#define FLASH_ICR_CRCRDERRF_Msk              (0x1UL << FLASH_ICR_CRCRDERRF_Pos)                  /*!< 0x10000000 */
#define FLASH_ICR_CRCRDERRF                  FLASH_ICR_CRCRDERRF_Msk                             /*!< CRC read error flag clear */

/*****************  Bits definition for FLASH_CRCCR register  *****************/
#define FLASH_CRCCR_CRC_SECT_Pos             (0U)
#define FLASH_CRCCR_CRC_SECT_Msk             (0x7UL << FLASH_CRCCR_CRC_SECT_Pos)                 /*!< 0x00000007 */
#define FLASH_CRCCR_CRC_SECT                 FLASH_CRCCR_CRC_SECT_Msk                            /*!< CRC sector number */
#define FLASH_CRCCR_CRC_SECT_0               (0x1UL << FLASH_CRCCR_CRC_SECT_Pos)                 /*!< 0x00000001 */
#define FLASH_CRCCR_CRC_SECT_1               (0x2UL << FLASH_CRCCR_CRC_SECT_Pos)                 /*!< 0x00000002 */
#define FLASH_CRCCR_CRC_SECT_2               (0x4UL << FLASH_CRCCR_CRC_SECT_Pos)                 /*!< 0x00000004 */
#define FLASH_CRCCR_CRC_BY_SECT_Pos          (9U)
#define FLASH_CRCCR_CRC_BY_SECT_Msk          (0x1UL << FLASH_CRCCR_CRC_BY_SECT_Pos)              /*!< 0x00000200 */
#define FLASH_CRCCR_CRC_BY_SECT              FLASH_CRCCR_CRC_BY_SECT_Msk                         /*!< CRC sector mode select bit */
#define FLASH_CRCCR_ADD_SECT_Pos             (10U)
#define FLASH_CRCCR_ADD_SECT_Msk             (0x1UL << FLASH_CRCCR_ADD_SECT_Pos)                 /*!< 0x00000400 */
#define FLASH_CRCCR_ADD_SECT                 FLASH_CRCCR_ADD_SECT_Msk                            /*!< CRC sector select bit */
#define FLASH_CRCCR_CLEAN_SECT_Pos           (11U)
#define FLASH_CRCCR_CLEAN_SECT_Msk           (0x1UL << FLASH_CRCCR_CLEAN_SECT_Pos)               /*!< 0x00000800 */
#define FLASH_CRCCR_CLEAN_SECT               FLASH_CRCCR_CLEAN_SECT_Msk                          /*!< CRC sector list clear bit */
#define FLASH_CRCCR_START_CRC_Pos            (16U)
#define FLASH_CRCCR_START_CRC_Msk            (0x1UL << FLASH_CRCCR_START_CRC_Pos)                /*!< 0x00010000 */
#define FLASH_CRCCR_START_CRC                FLASH_CRCCR_START_CRC_Msk                           /*!< CRC start bit */
#define FLASH_CRCCR_CLEAN_CRC_Pos            (17U)
#define FLASH_CRCCR_CLEAN_CRC_Msk            (0x1UL << FLASH_CRCCR_CLEAN_CRC_Pos)                /*!< 0x00020000 */
#define FLASH_CRCCR_CLEAN_CRC                FLASH_CRCCR_CLEAN_CRC_Msk                           /*!< CRC clear bit */
#define FLASH_CRCCR_CRC_BURST_Pos            (20U)
#define FLASH_CRCCR_CRC_BURST_Msk            (0x3UL << FLASH_CRCCR_CRC_BURST_Pos)                /*!< 0x00300000 */
#define FLASH_CRCCR_CRC_BURST                FLASH_CRCCR_CRC_BURST_Msk                           /*!< CRC burst size */
#define FLASH_CRCCR_CRC_BURST_0              (0x1UL << FLASH_CRCCR_CRC_BURST_Pos)                /*!< 0x00100000 */
#define FLASH_CRCCR_CRC_BURST_1              (0x2UL << FLASH_CRCCR_CRC_BURST_Pos)                /*!< 0x00200000 */
#define FLASH_CRCCR_ALL_SECT_Pos             (24U)
#define FLASH_CRCCR_ALL_SECT_Msk             (0x1UL << FLASH_CRCCR_ALL_SECT_Pos)                 /*!< 0x01000000 */
#define FLASH_CRCCR_ALL_SECT                 FLASH_CRCCR_ALL_SECT_Msk                            /*!< All sectors selection */

/***************  Bits definition for FLASH_CRCSADDR register  ****************/
#define FLASH_CRCSADDR_CRC_START_ADDRESS_Pos (6U)
#define FLASH_CRCSADDR_CRC_START_ADDRESS_Msk (0x7FFUL << FLASH_CRCSADDR_CRC_START_ADDRESS_Pos)   /*!< 0x0001FFC0 */
#define FLASH_CRCSADDR_CRC_START_ADDRESS     FLASH_CRCSADDR_CRC_START_ADDRESS_Msk                /*!< CRC start address */

/***************  Bits definition for FLASH_CRCEADDR register  ****************/
#define FLASH_CRCEADDR_CRC_END_ADDRESS_Pos   (6U)
#define FLASH_CRCEADDR_CRC_END_ADDRESS_Msk   (0x7FFUL << FLASH_CRCEADDR_CRC_END_ADDRESS_Pos)     /*!< 0x0001FFC0 */
#define FLASH_CRCEADDR_CRC_END_ADDRESS       FLASH_CRCEADDR_CRC_END_ADDRESS_Msk                  /*!< CRC end address */

