MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S3A8/mcu.h
#define RCC_PLL2DIVR1_DIVR_Pos        (24U)
#define RCC_PLL2DIVR1_DIVR_Msk        (0x7FUL << RCC_PLL2DIVR1_DIVR_Pos)     /*!< 0x7F000000 */
#define RCC_PLL2DIVR1_DIVR            RCC_PLL2DIVR1_DIVR_Msk                 /*!< DIVR2[6:0] bits: PLL2 DIVR division factor */
#define RCC_PLL2DIVR1_DIVR_0          (0x001UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x01000000 */
#define RCC_PLL2DIVR1_DIVR_1          (0x002UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x02000000 */
#define RCC_PLL2DIVR1_DIVR_2          (0x004UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x04000000 */
#define RCC_PLL2DIVR1_DIVR_3          (0x008UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x08000000 */
#define RCC_PLL2DIVR1_DIVR_4          (0x010UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x10000000 */
#define RCC_PLL2DIVR1_DIVR_5          (0x020UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x20000000 */
#define RCC_PLL2DIVR1_DIVR_6          (0x040UL << RCC_PLL2DIVR1_DIVR_Pos)    /*!< 0x40000000 */

/********************  Bit definition for RCC_PLL2FRACR register  *************/
#define RCC_PLL2FRACR_FRACN_Pos        (3U)
#define RCC_PLL2FRACR_FRACN_Msk        (0x1FFFUL << RCC_PLL2FRACR_FRACN_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL2FRACR_FRACN            RCC_PLL2FRACR_FRACN_Msk               /*!< FRACN[12:0] bits */

/********************  Bit definition for RCC_PLL3DIVR1 register  *************/
#define RCC_PLL3DIVR1_DIVN_Pos        (0U)
#define RCC_PLL3DIVR1_DIVN_Msk        (0x1FFUL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x000001FF */
#define RCC_PLL3DIVR1_DIVN            RCC_PLL3DIVR1_DIVN_Msk                 /*!< DIVN3[8:0] bits: PLL3 DIVN division factor */
#define RCC_PLL3DIVR1_DIVN_0          (0x001UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000001 */
#define RCC_PLL3DIVR1_DIVN_1          (0x002UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000002 */
#define RCC_PLL3DIVR1_DIVN_2          (0x004UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000004 */
#define RCC_PLL3DIVR1_DIVN_3          (0x008UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000008 */
#define RCC_PLL3DIVR1_DIVN_4          (0x010UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000010 */
#define RCC_PLL3DIVR1_DIVN_5          (0x020UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000020 */
#define RCC_PLL3DIVR1_DIVN_6          (0x040UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000040 */
#define RCC_PLL3DIVR1_DIVN_7          (0x080UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000080 */
#define RCC_PLL3DIVR1_DIVN_8          (0x100UL << RCC_PLL3DIVR1_DIVN_Pos)    /*!< 0x00000100 */

#define RCC_PLL3DIVR1_DIVP_Pos        (9U)
#define RCC_PLL3DIVR1_DIVP_Msk        (0x7FUL << RCC_PLL3DIVR1_DIVP_Pos)     /*!< 0x0000FE00 */
#define RCC_PLL3DIVR1_DIVP            RCC_PLL3DIVR1_DIVP_Msk                 /*!< DIVP3[6:0] bits: PLL3 DIVP division factor */
#define RCC_PLL3DIVR1_DIVP_0          (0x001UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00000200 */
#define RCC_PLL3DIVR1_DIVP_1          (0x002UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00000400 */
#define RCC_PLL3DIVR1_DIVP_2          (0x004UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00000800 */
#define RCC_PLL3DIVR1_DIVP_3          (0x008UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00001000 */
#define RCC_PLL3DIVR1_DIVP_4          (0x010UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00002000 */
#define RCC_PLL3DIVR1_DIVP_5          (0x020UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00004000 */
#define RCC_PLL3DIVR1_DIVP_6          (0x040UL << RCC_PLL3DIVR1_DIVP_Pos)    /*!< 0x00008000 */

#define RCC_PLL3DIVR1_DIVQ_Pos        (16U)
#define RCC_PLL3DIVR1_DIVQ_Msk        (0x7FUL << RCC_PLL3DIVR1_DIVQ_Pos)     /*!< 0x007F0000 */
#define RCC_PLL3DIVR1_DIVQ            RCC_PLL3DIVR1_DIVQ_Msk                 /*!< DIVQ3[6:0] bits: PLL3 DIVQ division factor */
#define RCC_PLL3DIVR1_DIVQ_0          (0x001UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00010000 */
#define RCC_PLL3DIVR1_DIVQ_1          (0x002UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00020000 */
#define RCC_PLL3DIVR1_DIVQ_2          (0x004UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00040000 */
#define RCC_PLL3DIVR1_DIVQ_3          (0x008UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00080000 */
#define RCC_PLL3DIVR1_DIVQ_4          (0x010UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00100000 */
#define RCC_PLL3DIVR1_DIVQ_5          (0x020UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00200000 */
#define RCC_PLL3DIVR1_DIVQ_6          (0x040UL << RCC_PLL3DIVR1_DIVQ_Pos)    /*!< 0x00400000 */

#define RCC_PLL3DIVR1_DIVR_Pos        (24U)
#define RCC_PLL3DIVR1_DIVR_Msk        (0x7FUL << RCC_PLL3DIVR1_DIVR_Pos)     /*!< 0x7F000000 */
#define RCC_PLL3DIVR1_DIVR            RCC_PLL3DIVR1_DIVR_Msk                 /*!< DIVR3[6:0] bits: PLL3 DIVR division factor */
#define RCC_PLL3DIVR1_DIVR_0          (0x001UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x01000000 */
#define RCC_PLL3DIVR1_DIVR_1          (0x002UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x02000000 */
#define RCC_PLL3DIVR1_DIVR_2          (0x004UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x04000000 */
#define RCC_PLL3DIVR1_DIVR_3          (0x008UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x08000000 */
#define RCC_PLL3DIVR1_DIVR_4          (0x010UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x10000000 */
#define RCC_PLL3DIVR1_DIVR_5          (0x020UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x20000000 */
#define RCC_PLL3DIVR1_DIVR_6          (0x040UL << RCC_PLL3DIVR1_DIVR_Pos)    /*!< 0x40000000 */

/********************  Bit definition for RCC_PLL3FRACR register  *************/
#define RCC_PLL3FRACR_FRACN_Pos        (3U)
#define RCC_PLL3FRACR_FRACN_Msk        (0x1FFFUL << RCC_PLL3FRACR_FRACN_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL3FRACR_FRACN            RCC_PLL3FRACR_FRACN_Msk               /*!< FRACN[12:0] bits */

/********************  Bit definition for RCC_CCIPR1 register  **************/
#define RCC_CCIPR1_FMCSEL_Pos        (0U)
#define RCC_CCIPR1_FMCSEL_Msk        (0x3UL << RCC_CCIPR1_FMCSEL_Pos)        /*!< 0x00000003 */
#define RCC_CCIPR1_FMCSEL            RCC_CCIPR1_FMCSEL_Msk
#define RCC_CCIPR1_FMCSEL_0          (0x1UL << RCC_CCIPR1_FMCSEL_Pos)        /*!< 0x00000001 */
#define RCC_CCIPR1_FMCSEL_1          (0x2UL << RCC_CCIPR1_FMCSEL_Pos)        /*!< 0x00000002 */

