MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S3A8/mcu.h
/*****************  Bit definition for SBS_EXTICR4 register  ******************/
#define SBS_EXTICR4_PC_EXTI12_Pos        (0U)
#define SBS_EXTICR4_PC_EXTI12_Msk        (0xFUL << SBS_EXTICR4_PC_EXTI12_Pos)        /*!< 0x0000000F */
#define SBS_EXTICR4_PC_EXTI12            SBS_EXTICR4_PC_EXTI12_Msk                   /*!< Port configuration EXTI 12 */
#define SBS_EXTICR4_PC_EXTI12_0          (0x1UL << SBS_EXTICR4_PC_EXTI12_Pos)        /*!< 0x00000001 */
#define SBS_EXTICR4_PC_EXTI12_1          (0x2UL << SBS_EXTICR4_PC_EXTI12_Pos)        /*!< 0x00000002 */
#define SBS_EXTICR4_PC_EXTI12_2          (0x4UL << SBS_EXTICR4_PC_EXTI12_Pos)        /*!< 0x00000004 */
#define SBS_EXTICR4_PC_EXTI12_3          (0x8UL << SBS_EXTICR4_PC_EXTI12_Pos)        /*!< 0x00000008 */
#define SBS_EXTICR4_PC_EXTI13_Pos        (4U)
#define SBS_EXTICR4_PC_EXTI13_Msk        (0xFUL << SBS_EXTICR4_PC_EXTI13_Pos)        /*!< 0x000000F0 */
#define SBS_EXTICR4_PC_EXTI13            SBS_EXTICR4_PC_EXTI13_Msk                   /*!< Port configuration EXTI 13 */
#define SBS_EXTICR4_PC_EXTI13_0          (0x1UL << SBS_EXTICR4_PC_EXTI13_Pos)        /*!< 0x00000010 */
#define SBS_EXTICR4_PC_EXTI13_1          (0x2UL << SBS_EXTICR4_PC_EXTI13_Pos)        /*!< 0x00000020 */
#define SBS_EXTICR4_PC_EXTI13_2          (0x4UL << SBS_EXTICR4_PC_EXTI13_Pos)        /*!< 0x00000040 */
#define SBS_EXTICR4_PC_EXTI13_3          (0x8UL << SBS_EXTICR4_PC_EXTI13_Pos)        /*!< 0x00000080 */
#define SBS_EXTICR4_PC_EXTI14_Pos        (8U)
#define SBS_EXTICR4_PC_EXTI14_Msk        (0xFUL << SBS_EXTICR4_PC_EXTI14_Pos)        /*!< 0x00000F00 */
#define SBS_EXTICR4_PC_EXTI14            SBS_EXTICR4_PC_EXTI14_Msk                   /*!< Port configuration EXTI 14 */
#define SBS_EXTICR4_PC_EXTI14_0          (0x1UL << SBS_EXTICR4_PC_EXTI14_Pos)        /*!< 0x00000100 */
#define SBS_EXTICR4_PC_EXTI14_1          (0x2UL << SBS_EXTICR4_PC_EXTI14_Pos)        /*!< 0x00000200 */
#define SBS_EXTICR4_PC_EXTI14_2          (0x4UL << SBS_EXTICR4_PC_EXTI14_Pos)        /*!< 0x00000400 */
#define SBS_EXTICR4_PC_EXTI14_3          (0x8UL << SBS_EXTICR4_PC_EXTI14_Pos)        /*!< 0x00000800 */
#define SBS_EXTICR4_PC_EXTI15_Pos        (12U)
#define SBS_EXTICR4_PC_EXTI15_Msk        (0xFUL << SBS_EXTICR4_PC_EXTI15_Pos)        /*!< 0x0000F000 */
#define SBS_EXTICR4_PC_EXTI15            SBS_EXTICR4_PC_EXTI15_Msk                   /*!< Port configuration EXTI 15 */
#define SBS_EXTICR4_PC_EXTI15_0          (0x1UL << SBS_EXTICR4_PC_EXTI15_Pos)        /*!< 0x00001000 */
#define SBS_EXTICR4_PC_EXTI15_1          (0x2UL << SBS_EXTICR4_PC_EXTI15_Pos)        /*!< 0x00002000 */
#define SBS_EXTICR4_PC_EXTI15_2          (0x4UL << SBS_EXTICR4_PC_EXTI15_Pos)        /*!< 0x00004000 */
#define SBS_EXTICR4_PC_EXTI15_3          (0x8UL << SBS_EXTICR4_PC_EXTI15_Pos)        /*!< 0x00008000 */


/******************************************************************************/
/*                                                                            */
/*                           SDMMC Interface                                  */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SDMMC_POWER register  *****************/
#define SDMMC_POWER_PWRCTRL_Pos             (0U)
#define SDMMC_POWER_PWRCTRL_Msk             (0x3UL << SDMMC_POWER_PWRCTRL_Pos)              /*!< 0x00000003 */
#define SDMMC_POWER_PWRCTRL                 SDMMC_POWER_PWRCTRL_Msk                         /*!< SDMMC state control bits */
#define SDMMC_POWER_PWRCTRL_0               (0x1UL << SDMMC_POWER_PWRCTRL_Pos)              /*!< 0x00000001 */
#define SDMMC_POWER_PWRCTRL_1               (0x2UL << SDMMC_POWER_PWRCTRL_Pos)              /*!< 0x00000002 */
#define SDMMC_POWER_VSWITCH_Pos             (2U)
#define SDMMC_POWER_VSWITCH_Msk             (0x1UL << SDMMC_POWER_VSWITCH_Pos)              /*!< 0x00000004 */
#define SDMMC_POWER_VSWITCH                 SDMMC_POWER_VSWITCH_Msk                         /*!< Voltage switch sequence start */
#define SDMMC_POWER_VSWITCHEN_Pos           (3U)
#define SDMMC_POWER_VSWITCHEN_Msk           (0x1UL << SDMMC_POWER_VSWITCHEN_Pos)            /*!< 0x00000008 */
#define SDMMC_POWER_VSWITCHEN               SDMMC_POWER_VSWITCHEN_Msk                       /*!< Voltage switch procedure enable */
#define SDMMC_POWER_DIRPOL_Pos              (4U)
#define SDMMC_POWER_DIRPOL_Msk              (0x1UL << SDMMC_POWER_DIRPOL_Pos)               /*!< 0x00000010 */
#define SDMMC_POWER_DIRPOL                  SDMMC_POWER_DIRPOL_Msk                          /*!< Data and command direction signals polarity selection */

/******************  Bit definition for SDMMC_CLKCR register  *****************/
#define SDMMC_CLKCR_CLKDIV_Pos              (0U)
#define SDMMC_CLKCR_CLKDIV_Msk              (0x3FFUL << SDMMC_CLKCR_CLKDIV_Pos)             /*!< 0x000003FF */
#define SDMMC_CLKCR_CLKDIV                  SDMMC_CLKCR_CLKDIV_Msk                          /*!< Clock divide factor */
#define SDMMC_CLKCR_PWRSAV_Pos              (12U)
#define SDMMC_CLKCR_PWRSAV_Msk              (0x1UL << SDMMC_CLKCR_PWRSAV_Pos)               /*!< 0x00001000 */
#define SDMMC_CLKCR_PWRSAV                  SDMMC_CLKCR_PWRSAV_Msk                          /*!< Power saving configuration bit */
#define SDMMC_CLKCR_WIDBUS_Pos              (14U)
#define SDMMC_CLKCR_WIDBUS_Msk              (0x3UL << SDMMC_CLKCR_WIDBUS_Pos)               /*!< 0x0000C000 */
#define SDMMC_CLKCR_WIDBUS                  SDMMC_CLKCR_WIDBUS_Msk                          /*!< Wide bus mode enable bit */
#define SDMMC_CLKCR_WIDBUS_0                (0x1UL << SDMMC_CLKCR_WIDBUS_Pos)               /*!< 0x00004000 */
#define SDMMC_CLKCR_WIDBUS_1                (0x2UL << SDMMC_CLKCR_WIDBUS_Pos)               /*!< 0x00008000 */
#define SDMMC_CLKCR_NEGEDGE_Pos             (16U)
#define SDMMC_CLKCR_NEGEDGE_Msk             (0x1UL << SDMMC_CLKCR_NEGEDGE_Pos)              /*!< 0x00010000 */
#define SDMMC_CLKCR_NEGEDGE                 SDMMC_CLKCR_NEGEDGE_Msk                         /*!< SDMMC_CK dephasing selection bit */
#define SDMMC_CLKCR_HWFC_EN_Pos             (17U)
#define SDMMC_CLKCR_HWFC_EN_Msk             (0x1UL << SDMMC_CLKCR_HWFC_EN_Pos)              /*!< 0x00020000 */
#define SDMMC_CLKCR_HWFC_EN                 SDMMC_CLKCR_HWFC_EN_Msk                         /*!< Hardware flow control enable */
#define SDMMC_CLKCR_DDR_Pos                 (18U)
#define SDMMC_CLKCR_DDR_Msk                 (0x1UL << SDMMC_CLKCR_DDR_Pos)                  /*!< 0x00040000 */
#define SDMMC_CLKCR_DDR                     SDMMC_CLKCR_DDR_Msk                             /*!< Data rate signal selection */
#define SDMMC_CLKCR_BUSSPEED_Pos            (19U)
#define SDMMC_CLKCR_BUSSPEED_Msk            (0x1UL << SDMMC_CLKCR_BUSSPEED_Pos)             /*!< 0x00080000 */
#define SDMMC_CLKCR_BUSSPEED                SDMMC_CLKCR_BUSSPEED_Msk                        /*!< Bus speed mode selection */
#define SDMMC_CLKCR_SELCLKRX_Pos            (20U)
#define SDMMC_CLKCR_SELCLKRX_Msk            (0x3UL << SDMMC_CLKCR_SELCLKRX_Pos)             /*!< 0x00300000 */
#define SDMMC_CLKCR_SELCLKRX                SDMMC_CLKCR_SELCLKRX_Msk                        /*!< Receive clock selection */
#define SDMMC_CLKCR_SELCLKRX_0              (0x1UL << SDMMC_CLKCR_SELCLKRX_Pos)             /*!< 0x00100000 */
#define SDMMC_CLKCR_SELCLKRX_1              (0x2UL << SDMMC_CLKCR_SELCLKRX_Pos)             /*!< 0x00200000 */

/*******************  Bit definition for SDMMC_ARG register  ******************/
#define SDMMC_ARG_CMDARG_Pos                (0U)
#define SDMMC_ARG_CMDARG_Msk                (0xFFFFFFFFUL << SDMMC_ARG_CMDARG_Pos)          /*!< 0xFFFFFFFF */
#define SDMMC_ARG_CMDARG                    SDMMC_ARG_CMDARG_Msk                            /*!< Command argument */

/*******************  Bit definition for SDMMC_CMD register  ******************/
#define SDMMC_CMD_CMDINDEX_Pos              (0U)
#define SDMMC_CMD_CMDINDEX_Msk              (0x3FUL << SDMMC_CMD_CMDINDEX_Pos)              /*!< 0x0000003F */
#define SDMMC_CMD_CMDINDEX                  SDMMC_CMD_CMDINDEX_Msk                          /*!< Command index */
#define SDMMC_CMD_CMDTRANS_Pos              (6U)
#define SDMMC_CMD_CMDTRANS_Msk              (0x1UL << SDMMC_CMD_CMDTRANS_Pos)               /*!< 0x00000040 */
#define SDMMC_CMD_CMDTRANS                  SDMMC_CMD_CMDTRANS_Msk                          /*!< CPSM treats the command as a data transfer command */
#define SDMMC_CMD_CMDSTOP_Pos               (7U)
#define SDMMC_CMD_CMDSTOP_Msk               (0x1UL << SDMMC_CMD_CMDSTOP_Pos)                /*!< 0x00000080 */
#define SDMMC_CMD_CMDSTOP                   SDMMC_CMD_CMDSTOP_Msk                           /*!< CPSM treats the command as a stop transmission command */
#define SDMMC_CMD_WAITRESP_Pos              (8U)
#define SDMMC_CMD_WAITRESP_Msk              (0x3UL << SDMMC_CMD_WAITRESP_Pos)               /*!< 0x00000300 */
#define SDMMC_CMD_WAITRESP                  SDMMC_CMD_WAITRESP_Msk                          /*!< Wait for response bits */
#define SDMMC_CMD_WAITRESP_0                (0x1UL << SDMMC_CMD_WAITRESP_Pos)               /*!< 0x00000100 */
#define SDMMC_CMD_WAITRESP_1                (0x2UL << SDMMC_CMD_WAITRESP_Pos)               /*!< 0x00000200 */
#define SDMMC_CMD_WAITINT_Pos               (10U)
#define SDMMC_CMD_WAITINT_Msk               (0x1UL << SDMMC_CMD_WAITINT_Pos)                /*!< 0x00000400 */
#define SDMMC_CMD_WAITINT                   SDMMC_CMD_WAITINT_Msk                           /*!< CPSM waits for interrupt request */
#define SDMMC_CMD_WAITPEND_Pos              (11U)
#define SDMMC_CMD_WAITPEND_Msk              (0x1UL << SDMMC_CMD_WAITPEND_Pos)               /*!< 0x00000800 */
#define SDMMC_CMD_WAITPEND                  SDMMC_CMD_WAITPEND_Msk                          /*!< CPSM waits for end of data transfer from DPSM */
#define SDMMC_CMD_CPSMEN_Pos                (12U)
#define SDMMC_CMD_CPSMEN_Msk                (0x1UL << SDMMC_CMD_CPSMEN_Pos)                 /*!< 0x00001000 */
#define SDMMC_CMD_CPSMEN                    SDMMC_CMD_CPSMEN_Msk                            /*!< Command path state machine enable bit */
#define SDMMC_CMD_DTHOLD_Pos                (13U)
#define SDMMC_CMD_DTHOLD_Msk                (0x1UL << SDMMC_CMD_DTHOLD_Pos)                 /*!< 0x00002000 */
#define SDMMC_CMD_DTHOLD                    SDMMC_CMD_DTHOLD_Msk                            /*!< Hold new data block transmission and reception in DPSM */
#define SDMMC_CMD_BOOTMODE_Pos              (14U)
#define SDMMC_CMD_BOOTMODE_Msk              (0x1UL << SDMMC_CMD_BOOTMODE_Pos)               /*!< 0x00004000 */
#define SDMMC_CMD_BOOTMODE                  SDMMC_CMD_BOOTMODE_Msk                          /*!< Select the boot mode procedure to be used */
#define SDMMC_CMD_BOOTEN_Pos                (15U)
#define SDMMC_CMD_BOOTEN_Msk                (0x1UL << SDMMC_CMD_BOOTEN_Pos)                 /*!< 0x00008000 */
#define SDMMC_CMD_BOOTEN                    SDMMC_CMD_BOOTEN_Msk                            /*!< Enable boot mode procedure */
#define SDMMC_CMD_CMDSUSPEND_Pos            (16U)
#define SDMMC_CMD_CMDSUSPEND_Msk            (0x1UL << SDMMC_CMD_CMDSUSPEND_Pos)             /*!< 0x00010000 */
#define SDMMC_CMD_CMDSUSPEND                SDMMC_CMD_CMDSUSPEND_Msk                        /*!< CPSM treats the command as a suspend or resume command */

/*****************  Bit definition for SDMMC_RESPCMD register  ****************/
#define SDMMC_RESPCMD_RESPCMD_Pos           (0U)
#define SDMMC_RESPCMD_RESPCMD_Msk           (0x3FUL << SDMMC_RESPCMD_RESPCMD_Pos)           /*!< 0x0000003F */
#define SDMMC_RESPCMD_RESPCMD               SDMMC_RESPCMD_RESPCMD_Msk                       /*!< Response command index */

